<details ><summary>apply for core 2024-12-16 05:25:18 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/testing.pinner.xyz-devops#core has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudflare_dns_record.renterd will be created
  + resource "cloudflare_dns_record" "renterd" {
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "renterd.testing.pinner.xyz"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "594c7058710c206292951980b32a4881"
    }

  # cloudflare_dns_record.renterd_s3 will be created
  + resource "cloudflare_dns_record" "renterd_s3" {
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "s3.renterd.testing.pinner.xyz"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = "594c7058710c206292951980b32a4881"
    }

  # module.etcd.module.etcd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.mysql.module.mysql_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + etcd_endpoint       = (known after apply)
  + etcd_password       = (sensitive value)
  + mysql_endpoint      = (known after apply)
  + renterd_endpoint    = "renterd.testing.pinner.xyz"
  + renterd_s3_endpoint = "s3.renterd.testing.pinner.xyz"
module.etcd.module.etcd_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Creating...
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.mysql.module.mysql_deployment.akash_deployment.service: Creation complete after 25s [id=19375915:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.etcd.module.etcd_deployment.akash_deployment.service: Still creating... [30s elapsed]
module.etcd.module.etcd_deployment.akash_deployment.service: Creation complete after 30s [id=19375917:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 23s [id=19375920:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudflare_dns_record.renterd_s3: Creating...
cloudflare_dns_record.renterd: Creating...
cloudflare_dns_record.renterd_s3: Creation complete after 0s [id=4984ea678771fd556be0c0da8c2b0661]
cloudflare_dns_record.renterd: Creation complete after 0s [id=2849414dddbb422f92d742ef8a5bc525]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

etcd_endpoint = "provider.ny-01.node.infra.lumeweb.com:30561"
etcd_password = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30269"
renterd_endpoint = "renterd.testing.pinner.xyz"
renterd_s3_endpoint = "s3.renterd.testing.pinner.xyz"

```
</details>

</details>